/****************************************************************************
*  This file is part of the WLAN-Ethernut device driver.
*
*  Copyright (c) 2004 by Michael Fischer. All rights reserved.
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*  1. Redistributions of source code must retain the above copyright
*     notice, this list of conditions and the following disclaimer.
*  2. Redistributions in binary form must reproduce the above copyright
*     notice, this list of conditions and the following disclaimer in the
*     documentation and/or other materials provided with the distribution.
*  3. Neither the name of the author nor the names of its contributors may
*     be used to endorse or promote products derived from this software
*     without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
*  FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL
*  THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
*  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
*  BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
*  OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED

*  THIS SOFTWARE IS PROVIDED BY Bill Paul AND CONTRIBUTORS ``AS IS'' AND
*  ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
*  IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
*  ARE DISCLAIMED.  IN NO EVENT SHALL Bill Paul OR THE VOICES IN HIS HEAD
*  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
*  CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
*  SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
*  INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
*  CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
*  ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
*  THE POSSIBILITY OF SUCH DAMAGE.
*
****************************************************************************
*  History:
*
*  28.02.04  mifi   First Version
*                   If you like to see the original source. Take a look
*                   in if_wi.c from FreeBSD.
*  01.03.04  mifi   Now we use a timeout in our Thread, and check if we lost
*                   the card. In this case we try to Init it again.
*  02.03.04  mifi   Remove QuickHack for Networkname and WEP.
*  03.03.04  mifi   Use struct to config WLAN (WLAN_IOCTL_SET_CONFIG)
*  04.03.04  mifi   Add function to get WLAN_STATUS (WLAN_IOCTL_GET_STATUS)
*  06.03.04  mifi   Remove all @@MF later for monitor mode.
*                   It does not work with my card, and I think we need a
*                   special firmware for it.
****************************************************************************/
#define __WLANDRV_C__

#include <compiler.h>
#include <stdio.h>
#include <stddef.h>
#include <string.h>

#include <sys/timer.h>
#include <sys/thread.h>
#include <sys/event.h>
#include <errno.h>
#include <netinet/if_ether.h>
#include <net/ether.h>
#include <net/if_var.h>
#include <dev/irqreg.h>

#include <dev/wlantypes.h>
#include <dev/pcmcia.h>
#include <dev/wlancfg.h>
#include <dev/wlan.h>
#include <dev/wlandrv.h>

/*==========================================================*/
/*  DEFINE: All Structures and Common Constants             */
/*==========================================================*/
#if (_DEBUG >= 1)
#define Debug(_x)     if (bDebugState ) printf _x
#define Debug2(_x)    if (bDebugState > 1) printf _x
#define panic         printf
#else
#define Debug(_x)
#define Debug2(_x)
#define panic
#endif

#define WI_LOCK(sc)           NutEventWait(&hDeviceSemaphore,0)
#define WI_UNLOCK(sc)         NutEventPost(&hDeviceSemaphore)

#define ieee80211_new_state(_a,_b,_c)  _a->ic_state=_b
#define isset(_a,_b)                  (*_a & (1<<_b))

#define CSR_WRITE_2(_a,_b,_c) pcmcia_WriteReg(_b,_c)
#define CSR_READ_2(_a,_b)     pcmcia_ReadReg(_b)

/*
 * Length information
 */
#define WLAN_MIN_ETHERNET_FRAME_LEN	60
#define WLAN_MAX_ETHERNET_FRAME_LEN	1514
#define WLAN_ETHERNET_HEADER_LEN		14

/*
 * Interrupt define
*/
#define WI_INTRS  (WI_EV_RX | WI_EV_ALLOC | WI_EV_INFO)

struct wi_card_ident {
    u_int16_t card_id;
    char *card_name;
    u_int8_t firm_type;
};

struct ieee80211_frame_addr4 {
    u_int8_t i_fc[2];
    u_int8_t i_dur[2];
    u_int8_t i_addr1[IEEE80211_ADDR_LEN];
    u_int8_t i_addr2[IEEE80211_ADDR_LEN];
    u_int8_t i_addr3[IEEE80211_ADDR_LEN];
    u_int8_t i_seq[2];
    u_int8_t i_addr4[IEEE80211_ADDR_LEN];
};

/*
 * transmit/receive frame structure
*/
struct wi_frame {
    u_int16_t wi_status;        /* 0x00 */
    u_int16_t wi_rx_tstamp1;    /* 0x02 */
    u_int16_t wi_rx_tstamp0;    /* 0x04 */
    u_int8_t wi_rx_silence;     /* 0x06 */
    u_int8_t wi_rx_signal;      /* 0x07 */
    u_int8_t wi_rx_rate;        /* 0x08 */
    u_int8_t wi_rx_flow;        /* 0x09 */
    u_int8_t wi_tx_rtry;        /* 0x0a *//* Prism2 AP Only */
    u_int8_t wi_tx_rate;        /* 0x0b *//* Prism2 AP Only */
    u_int16_t wi_tx_ctl;        /* 0x0c */
    struct ieee80211_frame_addr4 wi_whdr;       /* 0x0e */
    u_int16_t wi_dat_len;       /* 0x2c */
    struct ether_header wi_ehdr;        /* 0x2e */
};

/*
 * Station set identification (SSID). (0xFC02, 0xFC04)
*/
struct wi_ssid {
    u_int16_t wi_len;
    u_int8_t wi_ssid[32];
};

/*
 * Ethernet LLCS + SNAP header
*/
typedef struct {
    u_int16_t DSAPSSAP;
    u_int16_t Control;
    u_int16_t MustZero;
    u_int16_t Type;
} LLCS_SNAP_HEADER;

/*==========================================================*/
/*  DEFINE: Prototypes                                      */
/*==========================================================*/

/*==========================================================*/
/*  DEFINE: Definition of all local Data                    */
/*==========================================================*/
static HANDLE hDeviceSemaphore;
static BYTE bDebugState = 0;

struct wi_card_ident wi_card_ident[] = {
    /*
     * CARD_ID          CARD_NAME      FIRM_TYPE
     */
#if (WLAN_SUPPORT_LUCENT >= 1)
    {WI_NIC_LUCENT_ID, WI_NIC_LUCENT_STR, WI_LUCENT},
